# Используем базовый образ Node.js
FROM node:20

# Создаем директорию для приложения внутри образа и устанавливаем ее в качестве рабочей
WORKDIR /usr/src/app

# Копируем файлы package.json и package-lock.json (если есть) в директорию приложения
COPY package*.json ./

# Устанавливаем зависимости приложения
RUN npm install

# Копируем исходный код приложения в директорию приложения
COPY . .

# Определяем порт, который будет прослушивать наше приложение
EXPOSE 3000

# Команда для запуска сервера при старте контейнера
CMD ["npm", "start"]


